# 撲克牌抽籤遊戲
import random
import time
dic = {
    "梅花A": 1, "梅花2": 2, "梅花3": 3, "梅花4": 4, "梅花5": 5, "梅花6": 6, "梅花7": 7, "梅花8": 8, "梅花9": 9, "梅花10": 10, "梅花J": 11, "梅花Q": 12, "梅花K": 13,
    "方塊A": 14, "方塊2": 15, "方塊3": 16, "方塊4": 17, "方塊5": 18, "方塊6": 19, "方塊7": 20, "方塊8": 21, "方塊9": 22, "方塊10": 23, "方塊J": 24, "方塊Q": 25, "方塊K": 26,
    "紅心A": 27, "紅心2": 28, "紅心3": 29, "紅心4": 30, "紅心5": 31, "紅心6": 32, "紅心7": 33, "紅心8": 34, "紅心9": 35, "紅心10": 36, "紅心J": 37, "紅心Q": 38, "紅心K": 39,
    "黑桃A": 40, "黑桃2": 41, "黑桃3": 42, "黑桃4": 43, "黑桃5": 44, "黑桃6": 45, "黑桃7": 46, "黑桃8": 47, "黑桃9": 48, "黑桃10": 49, "黑桃J": 50, "黑桃Q": 51, "黑桃K": 52
}
A = input("請輸入玩家A的名字:")
time.sleep(1)
B = input("請輸入玩家B的名字:")
time.sleep(1)
print("~~~~~~撲克牌比大小~~~~~~")
time.sleep(1)
print("~~~~~~~~遊戲開始~~~~~~~~")
time.sleep(1)
print(A+"玩家抽籤中")
time.sleep(2)
n1 = random.choice(list(dic))
print(A+"玩家抽到:", n1)
v1 = dic[n1]
del dic[n1]
n2 = random.choice(list(dic))
time.sleep(1)
print(B+"玩家抽籤中")
time.sleep(2)
print(B+"玩家抽到:", n2)
v2 = dic[n2]
time.sleep(1)
print("遊戲結果")
time.sleep(1)
if v1 > v2:
    print(A+"玩家贏惹")
else:
    print(B+"玩家贏惹")

# (梅花1,梅花2,梅花3,梅花4,梅花5,梅花6,梅花7,梅花8,梅花9,梅花10,梅花11,梅花12,梅花13) = range(1,14)
# x=(梅花1,梅花2,梅花3,梅花4,梅花5,梅花6,梅花7,梅花8,梅花9,梅花10,梅花11,梅花12,梅花13)
# for i in range(1,14):
#     globals()["梅花"+str(i)]=(i)
#     globals()["方塊"+str(i)]=(13+i)
#     globals()["紅心"+str(i)]=(26+i)
#     globals()["黑桃"+str(i)]=(39+i)
# print(梅花1)
# n=str(random.randint(1,13))
# A=random.choice(["梅花","方塊","紅心","黑桃"])
# num=A+n
# print(num)
